---
kind: method
id: M:Autodesk.Revit.DB.Analysis.HVACLoadSpaceType.IsNameUnique(System.String)
source: html/40cad215-2c37-b53b-716e-2a4f671ad1a3.htm
---
# Autodesk.Revit.DB.Analysis.HVACLoadSpaceType.IsNameUnique Method

Determines whether a potential space type name is unique.

## Syntax (C#)
```csharp
public bool IsNameUnique(
	string name
)
```

## Parameters
- **name** (`System.String`) - The candidate name.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null